Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_gpio.h
/**************************************************************************//**
 * @file     rtl8735b_gpio.h
 * @brief    This file defines GPIO HAL macros and data types.
 *
 * @version  V1.00
 * @date     2021-05-20
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

/**
 * @addtogroup hs_hal_gpio GPIO
 * @ingroup 8195bh_hal
 * @{
 * @brief The GPIO HAL module of the HS platform.
 */

#ifndef RTL8735B_GPIO_H
#define RTL8735B_GPIO_H

#ifdef __cplusplus
extern "C" {
#endif

// AON/PON/SYSON GPIO IP level registers
#include "rtl8735b_gpio_type.h"

// System level AON/PON/SYSON regions registers
#include "rtl8735b_aon_type.h"
#include "rtl8735b_pon_type.h"
#include "rtl8735b_syson_type.h"

#if !defined(CONFIG_BUILD_NONSECURE)

#undef AON_GPIO
#define AON_GPIO    (AON_GPIO_S_ADDR) // Secure address
#undef PON_GPIO
#define PON_GPIO    (PON_GPIO_S_ADDR) // Secure address
#undef SYSON_GPIO
#define SYSON_GPIO  (SYSON_GPIO_S_ADDR) // Secure address

#else

#undef AON_GPIO
#define AON_GPIO    (AON_GPIO_ADDR) // Non-Secure address
#undef PON_GPIO
#define PON_GPIO    (PON_GPIO_ADDR) // Non-Secure address
#undef SYSON_GPIO
#define SYSON_GPIO  (SYSON_GPIO_ADDR) // Non-Secure address

#endif

// Weide adapted from Crypto Example

/* ================================================================================================================= */
/* ================                            Device Specific Peripheral Section                             ====== */
/* ================================================================================================================= */

/// @cond DOXYGEN_GPIO_REG_TYPE


/* ================================================================================================================ */
/* ================                          Device Specific Peripheral Address Map                           ===== */
/* ================================================================================================================ */


/** @addtogroup device_gpio_addr AON/PON/SYSON GPIO Register Base Addresses
 *  @ingroup hal_gpio
 *  @{
 */

#define AON_GPIO_S_BASE               0x5000A800UL
#define AON_GPIO_NS_BASE              0x4000A800UL

#define PON_GPIO_S_BASE               0x5000AC00UL
#define PON_GPIO_NS_BASE              0x4000AC00UL

#define SYSON_GPIO_S_BASE             0x50001000UL
#define SYSON_GPIO_NS_BASE            0x40001000UL

/** @} */ /* End of group device_gpio_addr */


/* ================================================================================================================ */
/* ================                                  Peripheral declaration                                   ===== */
/* ================================================================================================================ */


/** @addtogroup device_gpio_decl AON/PON/SYSON GPIO Device Type
 *  @ingroup hal_gpio
 *  @{
 */

#define AON_GPIO_S_ADDR                             ((GPIO_TypeDef *)           AON_GPIO_S_BASE)
#define AON_GPIO_ADDR                               ((GPIO_TypeDef *)           AON_GPIO_NS_BASE)

#define PON_GPIO_S_ADDR                             ((GPIO_TypeDef *)           PON_GPIO_S_BASE)
#define PON_GPIO_ADDR                               ((GPIO_TypeDef *)           PON_GPIO_NS_BASE)

#define SYSON_GPIO_S_ADDR                           ((GPIO_TypeDef *)           SYSON_GPIO_S_BASE)
#define SYSON_GPIO_ADDR                             ((GPIO_TypeDef *)           SYSON_GPIO_NS_BASE)

/** @} */ /* End of group device_gpio_decl */

/// @endcond /* End of condition DOXYGEN_GPIO_REG_TYPE */


/**
  \brief  Defines the data type for GPIO pin name, a GPIO pin name is
          from combination of GPIO port and GPIO pin index.
 */
typedef struct gpio_pin_s {
	union {
		uint8_t pin_name;
		struct {
			uint8_t pin: 5;             ///< bit:  4.. 0  the pin index in a port
			uint8_t port: 3;            ///< bit:  7.. 5 the port index
		} pin_name_b;
	};
} gpio_pin_t, *pgpio_pin_t;

/**
  \brief  Defines the data type of GPIO port. The GPIO port data type is from the
          combination of port index, pin mask and the offset of the 1st pin.
 */
typedef struct gpio_port_s {
	union {
		uint32_t port_name;
		struct {
#if IS_CUT_TEST(CONFIG_CHIP_VER) // Test chip
			uint32_t mask: 18;            ///< bit: 17.. 0  the pin mask of the port
			uint32_t offset: 5;           ///< bit: 22.. 18 the 1st pin offset
			uint32_t : 1;                 ///< bit: 23.. 23 reserved
			uint32_t port: 3;             ///< bit: 26.. 24 the GPIO IP port index
#else // MP chip
			uint32_t mask: 21;            ///< bit: 20.. 0  the pin mask of the port
			uint32_t offset: 5;           ///< bit: 25.. 21 the 1st pin offset
			uint32_t : 2;                 ///< bit: 27.. 26 reserved
			uint32_t port: 3;             ///< bit: 30.. 28 the GPIO IP port index
#endif

		} port_name_b;
	};
} gpio_port_t, *pgpio_port_t;

/// Defines the maximum GPIO pin in a port
#define GPIO_MAX_PIN_IDX            32     // the maximum pin number in a GPIO IP port

/// Defines the maximum GPIO interrupt pins. It is the number of the PON or SYSON GPIO IRQ pins this platform can support.
#define GPIO_MAX_INT_PIN            16     // 0 ~ 15, one SYSON or PON GPIO IP only support 16 configurable interrupt pins
/// Defines the maximum GPIO interrupt pins. It is the number of the AON GPIO IRQ pins this platform can support.
#define AON_GPIO_MAX_INT_PIN        6     // 0 ~ 5, one AON GPIO IP only support 6 configurable interrupt pins

/// Defines the maximum GPIO debounce pins. It is the number of GPIO pin can enable the debounce function simultaneously.
#define GPIO_MAX_DEBOUNCE_PIN       16     // 0 ~ 15, one GPIO IP only support 16 configurable de-bounce pins
/// Defines the maximum GPIO debounce pins. It is the number of GPIO pin can enable the debounce function simultaneously.
#define AON_GPIO_MAX_DEBOUNCE_PIN   6     // 0 ~ 5, one GPIO IP only support 16 configurable de-bounce pins

/// define the GPIO port number. It's the number of the GPIO port this platform have.
#define GPIO_MAX_PORT_NUM           4      // 0 ~ 3, the port number of the GPIO IP // should be be 1 right?

/**
  \brief  Defines the GPIO port name
 */
enum {
	GPIO_IP_PORT0         = 0,
	GPIO_IP_PORT1         = 1,
	GPIO_IP_PORT2         = 2,
	GPIO_IP_PORT3         = 3,

	GPIO_IP_MAX_PORT_ID   = 4
};

/**
  \brief  Defines type of GPIO - AON/PON/SYSON GPIO.
 */
enum gpio_type_e {
	AonGPIO  = 0,
	SysonGPIO = 1,
	PonGPIO  = 2
};
typedef uint8_t gpio_type_t;

/**
  \brief  Defines GPIO interrupt polarity status
 */
enum {
	GPIO_LevelHigh      = 0,
	GPIO_LevelLow       = 1,
	GPIO_EdgeRising     = 0,
	GPIO_EdgeFalling    = 1,
	GPIO_EdgeDual       = 2
};

/**
  \brief  Defines GPIO interrupt trigger event type.
 */
enum  gpio_int_trigger_type_e {
	GPIO_IntType_None           = 0,
	GPIO_IntType_EdgeRising     = 1,
	GPIO_IntType_EdgeFalling    = 2,
	GPIO_IntType_LevelLow       = 3,
	GPIO_IntType_LevelHigh      = 4,
	GPIO_IntType_EdgeDual       = 5,

	GPIO_IntType_Invalid        = 0x0F
};
typedef uint8_t gpio_int_trig_type_t;

/**
  \brief  Defines GPIO pin direction.
 */
enum  gpio_dir_e {
	GPIO_IN                  = 0,
	GPIO_OUT                 = 1
};
typedef uint8_t gpio_dir_t;

