Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_gpio.h
#if 0 // debounce clk always 32K for all GPIOs in ProII.
/*! define GPIO Debounce clock source */
enum  gpio_deb_clk_e {
	GPIO_DebClk_LS32K      = 0,
	GPIO_DebClk_HS32K      = 0
};
typedef uint8_t gpio_deb_clk_t;
#endif

/**
  \brief  Defines GPIO Interrupt clock source.
 */
enum  gpio_int_clk_e {
	GPIO_IntClk_100K    = 0, // 100k clk
	GPIO_IntClk_4M      = 1 // 4M clk
};
typedef uint8_t gpio_int_clk_t;

/**
  \brief  Defines IO pad pull control type.
 */
enum pin_pull_ctrl_e {
	GPIO_REG_PullCtrl_Set_HighZ = 0,
	GPIO_REG_PullCtrl_SetLow = 1,
	GPIO_REG_PullCtrl_SetHigh = 2
};

/**
  \brief  Defines IO pad pull type hardware supported.
 */
enum pin_pull_type_e {
	Pin_PullNone  = 0,
	Pin_PullUp    = 1,
	Pin_PullDown  = 2,
	Pin_PullDefault = Pin_PullNone
};
typedef uint8_t pin_pull_type_t;

#if 0 // Weide commented out because in ProII only SDIO has 2 voltages. GPIOs only have single voltage.
/**
  \brief  Defines IO pad voltage.
 */
enum io_pad_vol_e {
	IO_1p8V  = 0,        // IO pad voltage = 1.8V
	IO_3p3V  = 1         // IO pad voltage = 3.3V
};
typedef uint8_t io_pad_vol_t;
#endif

/**
  \brief  Defines GPIO interrupt call back function type.
 */
typedef void (*gpio_irq_callback_t)(uint32_t int_id, gpio_int_trig_type_t int_type);

/**
  \brief  The data structure for a GPIO pin HAL operation.
*/
typedef struct hal_gpio_pin_adapter_s {
	uint8_t pin_name;               ///< chip pin name to locate the GPIO pin by port & pin index
	uint8_t port_idx;               ///< the GPIO IP port index of the GPIO pin
	uint8_t pin_idx;                ///< the GPIO IP pin index of the GPIO port
	uint8_t debounce_idx;           ///< the index of GPIO debounce function allocated to this GPIO pin, 0 ~ 15
	uint32_t bit_mask;              ///< the bit mask to read/write register

	volatile uint32_t *in_port;     ///< the IN port address
	volatile uint32_t *out0_port;   ///< the OUT port address for write 0
	volatile uint32_t *out1_port;   ///< the OUT port address for write 1
	volatile uint32_t *outt_port;   ///< the OUT port address for toggling
	uint32_t s_ram_aon_gpio_on;     ///< Secure GPIO RAM has turned on power and clock for AON GPIO
	uint32_t s_ram_pon_gpio_on;     ///< Secure GPIO RAM has turned on power and clock for PON GPIO
	uint32_t s_ram_gpio_on;         ///< Secure GPIO RAM has turned on power and clock for SYSON GPIO
	uint32_t reserved[7];           ///< Reserved, make 32-byte aligned
} hal_gpio_adapter_t, *phal_gpio_adapter_t;

/**
  \brief  The data structure for a GPIO IRQ pin HAL operation.
*/
typedef struct hal_gpio_irq_pin_adapter_s {
	uint8_t     pin_name;           ///< chip pin name to locate the GPIO pin by port & pin index
	uint8_t     ip_pin_name;        ///< IP pin name to locate the GPIO pin by port & pin index
	uint8_t     int_idx;            ///< the GPIO interrupt function index, 0 ~ 15
	uint8_t     debounce_idx;       ///< the GPIO debounce function index, 0 ~ 15
	uint8_t     int_type;           ///< the GPIO interrupt trigger type
	uint8_t     resv[3];
	uint32_t    bit_mask;           ///< the bit mask to read register
	volatile uint32_t    *in_port;  ///< the IN port address
	gpio_irq_callback_t irq_callback;   ///< the call-back function of the GPIO IRQ
	uint32_t irq_callback_arg;      ///< the argument of the IRQ call-back function, it's a priviate data will be pass to the application with the call back function.
	void *pnext;                    ///< point to the next gpio_irq_pin_adapter
	uint32_t reserved[7];           ///< Reserved, make 32-byte aligned
} hal_gpio_irq_adapter_t, *phal_gpio_irq_adapter_t;

/**
  \brief  The data structure for a GPIO port HAL operation.
*/

typedef struct hal_gpio_port_adapter_s {
	uint8_t port_idx;               		///< the IP port index
	//uint8_t chip_port_idx;        		  ///< the chip port index (for pinmux reg & unreg purposes)
	uint8_t pin_offset;             		///< the pin0 of this port which is located at the offset of the IP port
	uint8_t reserv0;
	uint8_t reserv1;
	uint32_t pin_mask;              		///< the mask of pin to indicates what pin is included
//    uint32_t bit_mask;            		///< the bit mask to read/write register
	volatile uint32_t *in_port;     		///< the IN port address
	volatile uint32_t *out0_port;   		///< the OUT port address for write 0
	volatile uint32_t *out1_port;   		///< the OUT port address for write 1
	volatile uint32_t *outt_port;   		///< the OUT port address for toggling

	// To handle GPIO E overflow. Overflow means the bits from GPIO E fills to the end of GPIO Group A registers, and flows to use GPIO Group B registers.
	uint8_t pin_offset_PORTE; 				///< the pin0 of this port which is located at the offset of the IP port
	volatile uint32_t *in_port_PORTE;     	///< the IN port address - for GPIO Port E overflow
	volatile uint32_t *out0_port_PORTE;   	///< the OUT port address for write 0 - for GPIO Port E overflow
	volatile uint32_t *out1_port_PORTE;   	///< the OUT port address for write 1 - for GPIO Port E overflow
	volatile uint32_t *outt_port_PORTE;  	///< the OUT port address for toggling - for GPIO Port E overflow
	uint32_t reserved[5];                	///< Reserved, make 32-byte aligned
} hal_gpio_port_adapter_t, *phal_gpio_port_adapter_t;

/**
  \brief  The data structure for SYSON GPIO Common resource menagement.
*/
typedef struct hal_gpio_comm_adapter_s {
	volatile phal_gpio_irq_adapter_t gpio_irq_list_head; ///< the head of the gpio_irq_pin_adapter list
	volatile phal_gpio_irq_adapter_t gpio_irq_list_tail; ///< the tail of the gpio_irq_pin_adapter list
	volatile uint32_t gpio_irq_using;        			///< the bit map to indicate using status of IRQ functions // may be need to add more
	volatile uint32_t gpio_deb_using;        			///< the bit map to indicate using status of debounce functions
	volatile uint32_t critical_lv;  					///< to record AON GPIO HAL enter critical section level
	union {
		volatile uint32_t errs;
		struct {
			volatile uint32_t irq_err: 1;    			///< IRQ handler error
			volatile uint32_t init_err: 1;   			///< initial error
		} err_flag;
	};
	uint32_t reserved[2];                				///< Reserved, make 32-byte aligned
} hal_gpio_comm_adapter_t, *phal_gpio_comm_adapter_t;

/**
  \brief  The data structure for AON GPIO Common resource menagement.
*/
typedef struct hal_aon_gpio_comm_adapter_s {
	volatile phal_gpio_irq_adapter_t gpio_irq_list_head; ///< the head of the gpio_irq_pin_adapter list
	volatile phal_gpio_irq_adapter_t gpio_irq_list_tail; ///< the tail of the gpio_irq_pin_adapter list
	volatile uint32_t gpio_irq_using;        			///< the bit map to indicate using status of IRQ functions // may be need to add more
	volatile uint32_t gpio_deb_using;        			///< the bit map to indicate using status of debounce functions
	volatile uint32_t critical_lv; 						///< to record AON GPIO HAL enter critical section level
	union {
		volatile uint32_t errs;
		struct {
			volatile uint32_t irq_err: 1;   			///< IRQ handler error
			volatile uint32_t init_err: 1;  			///< initial error
		} err_flag;
	};
	uint32_t reserved[2];                				///< Reserved, make 32-byte aligned
} hal_aon_gpio_comm_adapter_t, *phal_aon_gpio_comm_adapter_t;

/**
  \brief  The data structure for PON GPIO Common resource menagement.
*/
typedef struct hal_pon_gpio_comm_adapter_s {
	volatile phal_gpio_irq_adapter_t gpio_irq_list_head; ///< the head of the gpio_irq_pin_adapter list
	volatile phal_gpio_irq_adapter_t gpio_irq_list_tail; ///< the tail of the gpio_irq_pin_adapter list
	volatile uint32_t gpio_irq_using;        			///< the bit map to indicate using status of IRQ functions // may be need to add more
	volatile uint32_t gpio_deb_using;        			///< the bit map to indicate using status of debounce functions
	volatile uint32_t critical_lv;  					///< to record AON GPIO HAL enter critical section level
	union {
		volatile uint32_t errs;
		struct {
			volatile uint32_t irq_err: 1;    			///< IRQ handler error
			volatile uint32_t init_err: 1;  			///< initial error
		} err_flag;
	};
	uint32_t reserved[2];                				///< Reserved, make 32-byte aligned
} hal_pon_gpio_comm_adapter_t, *phal_pon_gpio_comm_adapter_t;

/// @cond DOXYGEN_ROM_HAL_API

/**
 * @addtogroup hs_hal_gpio_rom_func GPIO HAL ROM APIs.
 * @ingroup hs_hal_gpio
 * @{
 */

void hal_rtl_gpio_reg_irq(gpio_type_t gpio_type, irq_handler_t irq_handler);
void hal_rtl_gpio_set_irq_priority(uint32_t priority);
hal_status_t hal_rtl_gpio_interrupt_clk_sel(gpio_type_t gpio_type, uint8_t clk_sel);
void hal_rtl_gpio_comm_init(phal_gpio_comm_adapter_t pgpio_comm_adp);
void hal_rtl_aon_gpio_comm_init(phal_aon_gpio_comm_adapter_t paon_gpio_comm_adp);
void hal_rtl_pon_gpio_comm_init(phal_pon_gpio_comm_adapter_t ppon_gpio_comm_adp);
void hal_rtl_gpio_comm_deinit(void);
void hal_rtl_aon_gpio_comm_deinit(void);  // new
void hal_rtl_pon_gpio_comm_deinit(void);  // new
void hal_rtl_gpio_enter_critical(void);
void hal_rtl_aon_gpio_enter_critical(void);  // new
void hal_rtl_pon_gpio_enter_critical(void);  // new
void hal_rtl_gpio_exit_critical(void);
void hal_rtl_aon_gpio_exit_critical(void);
void hal_rtl_pon_gpio_exit_critical(void);
hal_status_t hal_rtl_gpio_init(phal_gpio_adapter_t pgpio_adapter, uint32_t pin_name);
void hal_rtl_gpio_deinit(phal_gpio_adapter_t pgpio_adapter);
void hal_rtl_gpio_set_dir(phal_gpio_adapter_t pgpio_adapter, gpio_dir_t dir);
gpio_dir_t hal_rtl_gpio_get_dir(phal_gpio_adapter_t pgpio_adapter);
void hal_rtl_gpio_write(phal_gpio_adapter_t pgpio_adapter, uint32_t io_data);
void hal_rtl_gpio_toggle(phal_gpio_adapter_t pgpio_adapter);
uint32_t hal_rtl_gpio_read(phal_gpio_adapter_t pgpio_adapter);
hal_status_t hal_rtl_gpio_debounce_enable(phal_gpio_adapter_t pgpio_adapter, uint32_t debounce_us);
uint32_t hal_rtl_gpio_read_debounce(phal_gpio_adapter_t pgpio_adapter);
void hal_rtl_gpio_debounce_disable(phal_gpio_adapter_t pgpio_adapter);
hal_status_t hal_rtl_gpio_irq_init(phal_gpio_irq_adapter_t pgpio_irq_adapter, uint32_t pin_name,
								   gpio_irq_callback_t callback, uint32_t arg);
void hal_rtl_gpio_irq_deinit(phal_gpio_irq_adapter_t pgpio_irq_adapter);
void hal_rtl_gpio_irq_set_trig_type(phal_gpio_irq_adapter_t pgpio_adapter, gpio_int_trig_type_t int_type);
gpio_int_trig_type_t hal_rtl_gpio_irq_get_trig_type(phal_gpio_irq_adapter_t pgpio_adapter);
void hal_rtl_gpio_irq_enable(phal_gpio_irq_adapter_t pgpio_irq_adapter);
void hal_rtl_gpio_irq_disable(phal_gpio_irq_adapter_t pgpio_irq_adapter);
hal_status_t hal_rtl_gpio_irq_debounce_enable(phal_gpio_irq_adapter_t pgpio_irq_adapter, uint32_t debounce_us);
void hal_rtl_gpio_irq_debounce_disable(phal_gpio_irq_adapter_t pgpio_irq_adapter);
uint32_t hal_rtl_gpio_irq_read(phal_gpio_irq_adapter_t pgpio_irq_adapter);
hal_status_t hal_rtl_gpio_port_init(phal_gpio_port_adapter_t pgpio_port_adapter, uint32_t port_idx,
									uint32_t mask, gpio_dir_t dir);
void hal_rtl_gpio_port_deinit(phal_gpio_port_adapter_t pgpio_port_adapter);
#if !IS_CUT_TEST(CONFIG_CHIP_VER) // MP Chip
void hal_rtl_gpio_port_write(phal_gpio_port_adapter_t pgpio_port_adapter, uint32_t io_data);
#else // Test chip
void hal_rtl_gpio_port_write(phal_gpio_port_adapter_t pgpio_port_adapter, uint32_t mask, uint32_t io_data);
#endif

#if !IS_CUT_TEST(CONFIG_CHIP_VER) // MP Chip
uint32_t hal_rtl_gpio_port_read(phal_gpio_port_adapter_t pgpio_port_adapter);
#else // Test chip
uint32_t hal_rtl_gpio_port_read(phal_gpio_port_adapter_t pgpio_port_adapter, uint32_t mask);
#endif

hal_status_t hal_rtl_gpio_pull_ctrl(uint32_t pin_name, pin_pull_type_t pull_type);
hal_status_t hal_rtl_gpio_schmitt_ctrl(uint32_t pin_name, BOOLEAN ctrl);

#if !IS_CUT_TEST(CONFIG_CHIP_VER) // MP Chip
void hal_rtl_gpio_port_dir(phal_gpio_port_adapter_t pgpio_port_adapter, gpio_dir_t dir);
#else // Test chip
void hal_rtl_gpio_port_dir(phal_gpio_port_adapter_t pgpio_port_adapter, uint32_t mask, gpio_dir_t dir);
#endif

hal_status_t hal_rtl_gpio_drive_ctrl(uint32_t pin_name, uint8_t drv);
hal_status_t hal_rtl_gpio_slew_rate_ctrl(uint32_t pin_name, uint8_t slew_rate_func);

