Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_gpio.h
/** @} */ /* End of group hs_hal_gpio_rom_func */
/// @endcond /* End of condition DOXYGEN_ROM_HAL_API */

/**
  \brief  The data structure of the stubs functions of the GPIO HAL functions in ROM
*/
#if IS_CUT_TEST(CONFIG_CHIP_VER)
typedef struct hal_gpio_func_stubs_s {
	phal_gpio_comm_adapter_t *ppgpio_comm_adp;
	phal_aon_gpio_comm_adapter_t *ppaon_gpio_comm_adp;
	phal_pon_gpio_comm_adapter_t *pppon_gpio_comm_adp;
	//void (*hal_gpio_en_ctrl) (BOOL en); // should be defunct
	//void (*hal_gpio_pclk_ctrl) (BOOL en); // should be defunct
	//void (*hal_gpio_sclk_ctrl) (BOOL en); // should be defunct
	//void (*hal_gpio_int_clk) (gpio_int_clk_t clk_sel); // should be defunct
	void (*hal_gpio_reg_irq)(gpio_type_t gpio_type, irq_handler_t irq_handler);
	void (*hal_gpio_comm_init)(phal_gpio_comm_adapter_t pgpio_comm_adp);
	void (*hal_aon_gpio_comm_init)(phal_aon_gpio_comm_adapter_t paon_gpio_comm_adp);  // new
	void (*hal_pon_gpio_comm_init)(phal_pon_gpio_comm_adapter_t ppon_gpio_comm_adp);  // new
	void (*hal_gpio_comm_deinit)(void);
	void (*hal_aon_gpio_comm_deinit)(void);  // new
	void (*hal_pon_gpio_comm_deinit)(void);  // new
	void (*hal_gpio_enter_critical)(void);
	void (*hal_aon_gpio_enter_critical)(void);  // new
	void (*hal_pon_gpio_enter_critical)(void);  // new
	void (*hal_gpio_exit_critical)(void);
	void (*hal_aon_gpio_exit_critical)(void);  // new
	void (*hal_pon_gpio_exit_critical)(void);  // new
	hal_status_t (*hal_gpio_init)(phal_gpio_adapter_t pgpio_adapter, uint32_t pin_name);
	void (*hal_gpio_deinit)(phal_gpio_adapter_t pgpio_adapter);
	void (*hal_gpio_set_dir)(phal_gpio_adapter_t pgpio_adapter, gpio_dir_t dir);
	gpio_dir_t (*hal_gpio_get_dir)(phal_gpio_adapter_t pgpio_adapter);
	void (*hal_gpio_write)(phal_gpio_adapter_t pgpio_adapter, uint32_t io_data);
	void (*hal_gpio_toggle)(phal_gpio_adapter_t pgpio_adapter);
	uint32_t (*hal_gpio_read)(phal_gpio_adapter_t pgpio_adapter);
	hal_status_t (*hal_gpio_debounce_enable)(phal_gpio_adapter_t pgpio_adapter, uint32_t debounce_us);
	uint32_t (*hal_gpio_read_debounce)(phal_gpio_adapter_t pgpio_adapter);
	void (*hal_gpio_debounce_disable)(phal_gpio_adapter_t pgpio_adapter);
	hal_status_t (*hal_gpio_irq_init)(phal_gpio_irq_adapter_t pgpio_irq_adapter, uint32_t pin_name,
									  gpio_irq_callback_t callback, uint32_t arg);
	void (*hal_gpio_irq_deinit)(phal_gpio_irq_adapter_t pgpio_irq_adapter);
	void (*hal_gpio_irq_set_trig_type)(phal_gpio_irq_adapter_t pgpio_adapter, gpio_int_trig_type_t int_type);
	gpio_int_trig_type_t (*hal_gpio_irq_get_trig_type)(phal_gpio_irq_adapter_t pgpio_adapter);
	void (*hal_gpio_irq_enable)(phal_gpio_irq_adapter_t pgpio_irq_adapter);
	void (*hal_gpio_irq_disable)(phal_gpio_irq_adapter_t pgpio_irq_adapter);
	hal_status_t (*hal_gpio_irq_debounce_enable)(phal_gpio_irq_adapter_t pgpio_irq_adapter, uint32_t debounce_us);
	void (*hal_gpio_irq_debounce_disable)(phal_gpio_irq_adapter_t pgpio_irq_adapter);
	uint32_t (*hal_gpio_irq_read)(phal_gpio_irq_adapter_t pgpio_irq_adapter);
	hal_status_t (*hal_gpio_port_init)(phal_gpio_port_adapter_t pgpio_port_adapter, uint32_t port_idx,
									   uint32_t mask, gpio_dir_t dir);
	void (*hal_gpio_port_deinit)(phal_gpio_port_adapter_t pgpio_port_adapter);
	void (*hal_gpio_port_write)(phal_gpio_port_adapter_t pgpio_port_adapter, uint32_t mask, uint32_t io_data);
	uint32_t (*hal_gpio_port_read)(phal_gpio_port_adapter_t pgpio_port_adapter, uint32_t mask);
	hal_status_t (*hal_gpio_pull_ctrl)(uint32_t pin_name, pin_pull_type_t pull_type);
	hal_status_t (*hal_gpio_schmitt_ctrl)(uint32_t pin_name, BOOLEAN ctrl);
	void (*hal_gpio_port_dir)(phal_gpio_port_adapter_t pgpio_port_adapter, uint32_t mask, gpio_dir_t dir);
	hal_status_t (*hal_gpio_drive_ctrl)(uint32_t pin_name, uint8_t drv);
	hal_status_t (*hal_gpio_slew_rate_ctrl)(uint32_t pin_name, uint8_t slew_rate_func);
	uint32_t reserved[4];  // reserved space for next ROM code version function table extending.
} hal_gpio_func_stubs_t;
#else

typedef struct hal_gpio_func_stubs_s {
	phal_gpio_comm_adapter_t *ppgpio_comm_adp;
	phal_aon_gpio_comm_adapter_t *ppaon_gpio_comm_adp;
	phal_pon_gpio_comm_adapter_t *pppon_gpio_comm_adp;
	void (*hal_gpio_reg_irq)(gpio_type_t gpio_type, irq_handler_t irq_handler);
	hal_status_t (*hal_gpio_interrupt_clk_sel)(gpio_type_t gpio_type, uint8_t clk_sel);
	void (*hal_gpio_comm_init)(phal_gpio_comm_adapter_t pgpio_comm_adp);
	void (*hal_aon_gpio_comm_init)(phal_aon_gpio_comm_adapter_t paon_gpio_comm_adp);
	void (*hal_pon_gpio_comm_init)(phal_pon_gpio_comm_adapter_t ppon_gpio_comm_adp);
	void (*hal_gpio_comm_deinit)(void);
	void (*hal_aon_gpio_comm_deinit)(void);
	void (*hal_pon_gpio_comm_deinit)(void);
	void (*hal_gpio_enter_critical)(void);
	void (*hal_aon_gpio_enter_critical)(void);
	void (*hal_pon_gpio_enter_critical)(void);
	void (*hal_gpio_exit_critical)(void);
	void (*hal_aon_gpio_exit_critical)(void);
	void (*hal_pon_gpio_exit_critical)(void);
	hal_status_t (*hal_gpio_init)(phal_gpio_adapter_t pgpio_adapter, uint32_t pin_name);
	void (*hal_gpio_deinit)(phal_gpio_adapter_t pgpio_adapter);
	void (*hal_gpio_set_dir)(phal_gpio_adapter_t pgpio_adapter, gpio_dir_t dir);
	gpio_dir_t (*hal_gpio_get_dir)(phal_gpio_adapter_t pgpio_adapter);
	void (*hal_gpio_write)(phal_gpio_adapter_t pgpio_adapter, uint32_t io_data);
	void (*hal_gpio_toggle)(phal_gpio_adapter_t pgpio_adapter);
	uint32_t (*hal_gpio_read)(phal_gpio_adapter_t pgpio_adapter);
	hal_status_t (*hal_gpio_debounce_enable)(phal_gpio_adapter_t pgpio_adapter, uint32_t debounce_us);
	uint32_t (*hal_gpio_read_debounce)(phal_gpio_adapter_t pgpio_adapter);
	void (*hal_gpio_debounce_disable)(phal_gpio_adapter_t pgpio_adapter);
	hal_status_t (*hal_gpio_irq_init)(phal_gpio_irq_adapter_t pgpio_irq_adapter, uint32_t pin_name,
									  gpio_irq_callback_t callback, uint32_t arg);
	void (*hal_gpio_irq_deinit)(phal_gpio_irq_adapter_t pgpio_irq_adapter);
	void (*hal_gpio_irq_set_trig_type)(phal_gpio_irq_adapter_t pgpio_adapter, gpio_int_trig_type_t int_type);
	gpio_int_trig_type_t (*hal_gpio_irq_get_trig_type)(phal_gpio_irq_adapter_t pgpio_adapter);
	void (*hal_gpio_irq_enable)(phal_gpio_irq_adapter_t pgpio_irq_adapter);
	void (*hal_gpio_irq_disable)(phal_gpio_irq_adapter_t pgpio_irq_adapter);
	hal_status_t (*hal_gpio_irq_debounce_enable)(phal_gpio_irq_adapter_t pgpio_irq_adapter, uint32_t debounce_us);
	void (*hal_gpio_irq_debounce_disable)(phal_gpio_irq_adapter_t pgpio_irq_adapter);
	uint32_t (*hal_gpio_irq_read)(phal_gpio_irq_adapter_t pgpio_irq_adapter);
	hal_status_t (*hal_gpio_port_init)(phal_gpio_port_adapter_t pgpio_port_adapter, uint32_t port_idx,
									   uint32_t mask, gpio_dir_t dir);
	void (*hal_gpio_port_deinit)(phal_gpio_port_adapter_t pgpio_port_adapter);
	void (*hal_gpio_port_write)(phal_gpio_port_adapter_t pgpio_port_adapter, uint32_t io_data);
	uint32_t (*hal_gpio_port_read)(phal_gpio_port_adapter_t pgpio_port_adapter);
	hal_status_t (*hal_gpio_pull_ctrl)(uint32_t pin_name, pin_pull_type_t pull_type);
	hal_status_t (*hal_gpio_schmitt_ctrl)(uint32_t pin_name, BOOLEAN ctrl);
	void (*hal_gpio_port_dir)(phal_gpio_port_adapter_t pgpio_port_adapter, gpio_dir_t dir);
	hal_status_t (*hal_gpio_drive_ctrl)(uint32_t pin_name, uint8_t drv);
	hal_status_t (*hal_gpio_slew_rate_ctrl)(uint32_t pin_name, uint8_t slew_rate_func);
	uint32_t reserved[3];  // reserved space for next ROM code version function table extending.
} hal_gpio_func_stubs_t;
#endif

#ifdef __cplusplus
}
#endif

#endif /* RTL8735B_GPIO_H */


/** @} */ /* End of group hs_hal_gpio */

